
Функция getUserGET(Запрос)
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username"));
	
	ЗапросПользователи = Новый Запрос;
	Если Логин <> "" Тогда
		ЗапросПользователи.Текст =
		"ВЫБРАТЬ
		|    УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) КАК Ссылка,
		|    Пользователи.Наименование КАК Наименование,
		|    Пользователи.Код КАК Код
		|ИЗ
		|    Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|    НЕ Пользователи.ПометкаУдаления
		|    И Пользователи.Наименование = &Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|    Наименование";  
		
		ЗапросПользователи.УстановитьПараметр("Наименование", Логин); 
		
	КонецЕсли; 
	
	РезультатЗапроса = ЗапросПользователи.Выполнить();
	
	МассивПользователей= Новый Массив;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеПользователя = Новый Структура;
		ДанныеПользователя.Вставить("guid", Строка(Выборка.Ссылка));
		ДанныеПользователя.Вставить("name", Строка(Выборка.Наименование));
		ДанныеПользователя.Вставить("code", Строка(Выборка.Код));
		МассивПользователей.Добавить(ДанныеПользователя);
	КонецЦикла;
	
	Ответ = Новый HTTPСервисОтвет(200);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивПользователей);
	СтрокаОтвета = ЗаписьJSON.Закрыть();
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета);
	Возврат Ответ;
КонецФункции 

Функция regUserGET(Запрос) 
	
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username")); 
	Телефон = Строка(Запрос.ПараметрыЗапроса.Получить("phone")); 
	НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();  
	
	НовыйПользовательИБ.Имя = Логин;
	НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.Администратор);
	НовыйПользовательИБ.Записать(); НовыйПользователь = НовыйПользовательИБ;
	
	Контрагент = Справочники.Контрагенты.СоздатьЭлемент(); 
	Контрагент.Наименование = Логин;
	Контрагент.КонтактныйТелефон = Телефон; 
	Контрагент.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент;
	Контрагент.Комментарий = "Зарегистрирован через мобильное приложение"; 
	Контрагент.Записать();
	
	Пользователь = Справочники.Пользователи.СоздатьЭлемент();
	Пользователь.Код = НовыйПользователь.УникальныйИдентификатор;
	Пользователь.Наименование = НовыйПользователь.Имя;
	Пользователь.Клиент = Контрагент.Ссылка;  
	
	Попытка  Пользователь.Записать();
		ТекстОтвета = "Создан пользователь " + Пользователь.Наименование;  
		Ответ = Новый HTTPСервисОтвет(200);
	Исключение  ТекстОтвета = "Произошла ошибка при записи пользователя " + Логин + "! ";
		Ответ = Новый HTTPСервисОтвет(500); 
	КонецПопытки; 
	
	Возврат Ответ; 	
КонецФункции
        
  