&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыборЗаголовкаПоляНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВыборЗаголовкаПоляНаименование()
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент")Тогда
		ЭтаФорма.Элементы.Наименование.Заголовок = "ФИО";
		Элементы.ДатаРожденияКлиента.Видимость = Истина;
		Элементы.ПолКлиента.Видимость = Истина;
		Элементы.Договор.Видимость = Ложь;
	Иначе
		ЭтаФорма.Элементы.Наименование.Заголовок = "Наименование";
		Элементы.ДатаРожденияКлиента.Видимость = Ложь;
		Элементы.ПолКлиента.Видимость = Ложь;
		Элементы.Договор.Видимость = Истина;
	КонецЕсли;
	КонецПроцедуры


&НаКлиенте
	Процедура ТипКонтрагентаПриИзменении(Элемент)
	ВыборЗаголовкаПоляНаименование();
	КонецПроцедуры
	