
&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры   

&НаКлиенте  
Процедура СформироватьНаименование()
	Если ЗначениеЗаполнено(Объект.Номер)И ЗначениеЗаполнено (Объект.ДатаНачала) Тогда
		Объект.Наименование = "№" + Объект.Номер + " от " + Формат(Объект.ДатаНачала, "ДФ=dd.MM.yyyy") + "г.";
	ИначеЕсли ЗначениеЗаполнено (Объект.Номер) И НЕ ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.Наименование = "№" + Объект.Номер;
	Иначе
		Объект.Наименование = Формат(Объект.ДатаНачала, "ДФ=dd.MM.yyyy");
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент)
	УстановитьВидимость()
КонецПроцедуры
	
&НаКлиенте
Процедура УстановитьВидимость() 
	Элементы.ДатаОкончания.Видимость = Ложь;
	Если Объект.Бессрочный Тогда
		Элементы.ДатаОкончания.Видимость = Ложь;
		Если ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
			Объект.ДатаОкончания = "0001,01,01";
		КонецЕсли;
	Иначе
		Элементы.ДатаОкончания.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	ЕСЛИ НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		СформироватьНаименование();
		КонецЕсли;
КонецПроцедуры

