&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ответсвенный) Тогда
		Объект.Ответсвенный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;    
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
УстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры 

 &НаКлиенте
 Процедура УстановитьВидимость() 
	 
	 СтрокаТипПлательщика = "";
	 
	 Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника") Тогда
		 Элементы.Договор.Видимость = Ложь;
		 Элементы.Плательщик.Видимость = Истина;
		 СтрокаТипПлательщика = "СправочникСсылка.Сотрудники";
	 Иначе
		 Элементы.Договор.Видимость = Истина;
		 СтрокаТипПлательщика = "СправочникСсылка.Контрагенты";
	 КонецЕсли;
	 
	 
	 Если ЗначениеЗаполнено(СтрокаТипПлательщика) Тогда
		 Массив = Новый Массив();
		 Массив.Добавить(Тип(СтрокаТипПлательщика));
		 ОписаниеТипаПлательщика = Новый ОписаниеТипов(Массив);
		 Элементы.Плательщик.ОграничениеТипа = ОписаниеТипаПлательщика;
	 КонецЕсли;
	 
	 Если Элементы.Договор.Видимость = Истина
		 И ЗначениеЗаполнено(Объект.Плательщик) Тогда
		 Элементы.Договор.Видимость = ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Плательщик);
	 КонецЕсли;
	 
 КонецПроцедуры  
	
&НаСервереБезКонтекста
Функция ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Плательщик)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Плательщик", Плательщик);
	Запрос.Текст =
	
	
	"ВЫБРАТЬ
	|	Контрагенты.ТипКонтрагента КАК ТипКонтрагента,
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Плательщик";
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если ЗначениеЗаполнено(Выборка.ТипКонтрагента)
		И Выборка.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПлательщикПриИзменении(Элемент)         
	  УстановитьВидимость();
КонецПроцедуры

	
			
	
