&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ответсвенный) Тогда
		Объект.Ответсвенный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;    
КонецПроцедуры  

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
УстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
 Процедура УстановитьВидимость() 
	 
	 СтрокаТипПолучателя = "";
	 
	 Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаПодотчетнику")Тогда
		 Элементы.Договор.Видимость = Ложь;
		 Элементы.Получатель.Видимость = Истина;
		 СтрокаТипПолучателя = "СправочникСсылка.Сотрудники";
	 ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаЗаработнойПлаты") Тогда
		 Элементы.Договор.Видимость = Ложь;
		 Элементы.Получатель.Видимость = Истина;
		 СтрокаТипПолучателя = "СправочникСсылка.Сотрудники";
	 Иначе 
		 Элементы.Договор.Видимость = Истина;
		 СтрокаТипПлательщика = "СправочникСсылка.Контрагенты";
	 КонецЕсли;
	 
	 
	 Если ЗначениеЗаполнено(СтрокаТипПолучателя) Тогда
		 Массив = Новый Массив();
		 Массив.Добавить(Тип(СтрокаТипПолучателя));
		 ОписаниеТипаПолучателя = Новый ОписаниеТипов(Массив);
		 Элементы.Получатель.ОграничениеТипа = ОписаниеТипаПолучателя;
	 КонецЕсли;
	 
	 Если Элементы.Договор.Видимость = Истина
		 И ЗначениеЗаполнено(Объект.Получатель) Тогда
		 Элементы.Договор.Видимость = ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Объект.Получатель);
	 КонецЕсли;
	 
 КонецПроцедуры
 
 &НаСервереБезКонтекста
Функция ПроверитьВидимостьДоговораВЗависимостиОтТипаКонтрагента(Получатель)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Получатель", Получатель);
	Запрос.Текст =
	
	
	"ВЫБРАТЬ
	|	Контрагенты.ТипКонтрагента КАК ТипКонтрагента,
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Получатель";
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если ЗначениеЗаполнено(Выборка.ТипКонтрагента)
		И Выборка.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

