Процедура ПередЗаписью(Отказ,РежимЗаписи,РежимПроведения)
		ДлительностьУслуг = РассчитатьДатуОкончанияЗаписи();
	Если ДлительностьУслуг = 0 Тогда
		ДлительностьУслуг = 60;
	КонецЕсли;
	ДатаОкончанияЗаписи = ДатаЗаписи + ДлительностьУслуг*60;
	
	Если ЗначениеЗаполнено(Ссылка) И УслугаОказана = Ложь Тогда
		ПроверитьОказаниеУслуг();
	КонецЕсли;
		
КонецПроцедуры

Функция РассчитатьДатуОкончанияЗаписи()
	ТЧУслуги = Услуги.Выгрузить(, "Услуга");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЧУслуги", ТЧУслуги);
	
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|    ТЧУслуги.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_Услуги
	|ИЗ
	|    &ТЧУслуги КАК ТЧУслуги
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    СУММА(Ном.ДлительностьУслуги) КАК ДлительностьУслуги
	|ИЗ
	|    ВТ_Услуги КАК ВТ_Услуги
	|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|        ПО ВТ_Услуги.Услуга = Ном.Ссылка";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ДлительностьУслуги;
КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ЗаказыКлиентов.Записывать = Истина;
	Движение = Движения.ЗаказыКлиентов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Сумма = Услуги.Итог("Сумма");
	Движение.ЗаписьКлиента = Ссылка;
	
КонецПроцедуры

Процедура ПроверитьОказаниеУслуг()

Запрос = Новый Запрос;
Запрос.УстановитьПараметр("ДокументОснование",Ссылка);

Запрос.Текст = "ВЫБРАТЬ
 |    Реализация.Ссылка КАК Ссылка
 |ИЗ
 |    Документ.Реализация КАК Реализация
 |ГДЕ
 |    Реализация.ДокументОснование = &ДокументОснование
 |    И Реализация.Проведен
 |
 |СГРУППИРОВАТЬ ПО
 |    Реализация.Ссылка";

Рез = Запрос.Выполнить();
Если НЕ Рез.Пустой() Тогда
    УслугаОказана = Истина;
КонецЕсли;

КонецПроцедуры	
