
&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель")
		Тогда
		ЭтаФорма.Элементы.ИНН.Маска = "999999999999";
	Иначе
		ЭтаФорма.Элементы.ИНН.Маска = "9999999999";
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель")
		И СтрДлина(Объект.ИНН) <> 12 Тогда
		Сообщить ("Неверное количество символов. Для ИП = 12, для Юр.лиц = 10");
		Отказ = Истина;
		Возврат;
		КонецЕсли;

   Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо")
		И СтрДлина(Объект.ИНН) <> 10 Тогда
		Сообщить ("Неверное количество символов. Для ИП = 12, для Юр.лиц = 10");
		Отказ = Истина;
		Возврат;
		КонецЕсли;
	КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") Тогда
		Элементы.ГлавныйБухгалтер.Видимость = Истина;
	Иначе
		Элементы.ГлавныйБухгалтер.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

